#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/thclpr/default/runs/run-YdSCeBKKuttuT6Pe

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.rg_vnet.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg]
module.rg_aks.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/aks-default-rg]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/virtualNetworks/vnet-default]
module.vnet.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-default]
module.vnet.azurerm_subnet.subnet["nodes"]: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/nodes]
module.vnet.azurerm_subnet_network_security_group_association.nsga["nodes"]: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/nodes]
module.aks.azurerm_kubernetes_cluster.k8: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourcegroups/aks-default-rg/providers/Microsoft.ContainerService/managedClusters/aks-default]
module.nsg_rules["allow_http"].azurerm_network_security_rule.nsr: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-default/securityRules/allow_http]
module.aks_nodepool["user"].azurerm_kubernetes_cluster_node_pool.pool: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourcegroups/aks-default-rg/providers/Microsoft.ContainerService/managedClusters/aks-default/agentPools/user]
helm_release.releases: Refreshing state... [id=ingress-nginx]
module.aks_namespace["app"].kubernetes_namespace.ns: Refreshing state... [id=app]
module.aks_role_binding["nodeapi"].kubernetes_role_binding.rb: Refreshing state... [id=app/nodeapi]
module.aks_role["nodeapi"].kubernetes_role.r: Refreshing state... [id=default/nodeapi]
module.aks_hpa["nodeapi"].kubernetes_horizontal_pod_autoscaler.hpa: Refreshing state... [id=app/nodeapi]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.aks.azurerm_kubernetes_cluster.k8 has been changed
  ~ resource "azurerm_kubernetes_cluster" "k8" {
      + api_server_authorized_ip_ranges     = []
        id                                  = "/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourcegroups/aks-default-rg/providers/Microsoft.ContainerService/managedClusters/aks-default"
        name                                = "aks-default"
        tags                                = {
            "module_version" = "local"
            "source"         = "terraform"
            "workspace"      = "default"
        }
        # (15 unchanged attributes hidden)


      + auto_scaler_profile {
          + balance_similar_node_groups      = false
          + empty_bulk_delete_max            = "10"
          + expander                         = "random"
          + max_graceful_termination_sec     = "600"
          + max_node_provisioning_time       = "15m"
          + max_unready_nodes                = 3
          + max_unready_percentage           = 45
          + new_pod_scale_up_delay           = "0s"
          + scale_down_delay_after_add       = "10m"
          + scale_down_delay_after_delete    = "10s"
          + scale_down_delay_after_failure   = "3m"
          + scale_down_unneeded              = "10m"
          + scale_down_unready               = "20m"
          + scale_down_utilization_threshold = "0.5"
          + scan_interval                    = "10s"
          + skip_nodes_with_local_storage    = false
          + skip_nodes_with_system_pods      = true
        }

      ~ default_node_pool {
            name                         = "sys"
          + node_taints                  = []
          + tags                         = {}
            # (20 unchanged attributes hidden)
        }




        # (5 unchanged blocks hidden)
    }
  # module.aks_hpa["nodeapi"].kubernetes_horizontal_pod_autoscaler.hpa has been deleted
  - resource "kubernetes_horizontal_pod_autoscaler" "hpa" {
      - id = "app/nodeapi" -> null

      - metadata {
          - generation       = 0 -> null
          - name             = "nodeapi" -> null
          - namespace        = "app" -> null
          - resource_version = "712" -> null
          - uid              = "47bd9209-a767-4908-b07c-8f5c201f034b" -> null
        }

      - spec {
          - max_replicas                      = 20 -> null
          - min_replicas                      = 3 -> null
          - target_cpu_utilization_percentage = 0 -> null

          - behavior {
              - scale_down {
                  - select_policy                = "Min" -> null
                  - stabilization_window_seconds = 10 -> null

                  - policy {
                      - period_seconds = 5 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }

              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 10 -> null

                  - policy {
                      - period_seconds = 5 -> null
                      - type           = "Percent" -> null
                      - value          = 90 -> null
                    }
                }
            }

          - metric {
              - type = "Resource" -> null

              - resource {
                  - name = "cpu" -> null

                  - target {
                      - average_utilization = 80 -> null
                      - type                = "Utilization" -> null
                    }
                }
            }

          - scale_target_ref {
              - api_version = "apps/v1" -> null
              - kind        = "Deployment" -> null
              - name        = "nodeapi" -> null
            }
        }
    }
  # module.aks_namespace["app"].kubernetes_namespace.ns has been deleted
  - resource "kubernetes_namespace" "ns" {
      - id = "app" -> null

      - metadata {
          - generation       = 0 -> null
          - name             = "app" -> null
          - resource_version = "705" -> null
          - uid              = "7456ab23-47c2-4f69-ac26-034f330629c5" -> null
        }
    }
  # module.aks_role_binding["nodeapi"].kubernetes_role_binding.rb has been deleted
  - resource "kubernetes_role_binding" "rb" {
      - id = "app/nodeapi" -> null

      - metadata {
          - generation       = 0 -> null
          - labels           = {
              - "app" = "nodeapi"
            } -> null
          - name             = "nodeapi" -> null
          - namespace        = "app" -> null
          - resource_version = "711" -> null
          - uid              = "e15c8c88-58da-44c0-810f-1a0562b959fb" -> null
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Role" -> null
          - name      = "nodeapi" -> null
        }

      - subject {
          - kind      = "ServiceAccount" -> null
          - name      = "nodeapi" -> null
          - namespace = "app" -> null
        }
    }
  # helm_release.releases has been changed
  ~ resource "helm_release" "releases" {
        id                         = "ingress-nginx"
      ~ metadata                   = [
          ~ {
              ~ values      = jsonencode(
                  ~ {} -> null
                )
                # (6 unchanged elements hidden)
            },
        ]
        name                       = "ingress-nginx"
        # (25 unchanged attributes hidden)
    }
  # module.aks_role["nodeapi"].kubernetes_role.r has been changed
  ~ resource "kubernetes_role" "r" {
        id = "default/nodeapi"

      ~ metadata {
          + annotations      = {}
            name             = "nodeapi"
            # (5 unchanged attributes hidden)
        }

      ~ rule {
          + resource_names = []
            # (3 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_ingress.ingress["nodeapi"] will be created
  + resource "kubernetes_ingress" "ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "ingress.kubernetes.io/rewrite-target" = "/"
              + "kubernetes.io/ingress.class"          = "nginx"
            }
          + generation       = (known after apply)
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/"

                      + backend {
                          + service_name = "nodeapi"
                          + service_port = "3000"
                        }
                    }
                }
            }
        }
    }

  # module.aks_deployment["nodeapi"].kubernetes_deployment.deploy will be created
  + resource "kubernetes_deployment" "deploy" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "dev"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "3"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "dev"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "dev"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + affinity {
                      + node_affinity {

                          + required_during_scheduling_ignored_during_execution {
                              + node_selector_term {
                                  + match_expressions {
                                      + key      = "agentpool"
                                      + operator = "In"
                                      + values   = [
                                          + "sys",
                                          + "user",
                                        ]
                                    }
                                }
                            }
                        }

                      + pod_anti_affinity {
                          + preferred_during_scheduling_ignored_during_execution {
                              + weight = 100

                              + pod_affinity_term {
                                  + topology_key = "kubernetes.io/hostname"

                                  + label_selector {
                                      + match_expressions {
                                          + key      = "nodeapi"
                                          + operator = "In"
                                          + values   = [
                                              + "dev",
                                            ]
                                        }
                                    }
                                }
                            }
                        }
                    }

                  + container {
                      + image                      = "thclpr/nodeapi:1.0.1"
                      + image_pull_policy          = (known after apply)
                      + name                       = "nodeapi"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 3
                          + period_seconds        = 3
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 3000
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "40m"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "10m"
                              + "memory" = "1Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.aks_hpa["nodeapi"].kubernetes_horizontal_pod_autoscaler.hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 20
          + min_replicas                      = 3
          + target_cpu_utilization_percentage = (known after apply)

          + behavior {
              + scale_down {
                  + select_policy                = "Min"
                  + stabilization_window_seconds = 10

                  + policy {
                      + period_seconds = 5
                      + type           = "Percent"
                      + value          = 100
                    }
                }

              + scale_up {
                  + select_policy                = "Max"
                  + stabilization_window_seconds = 10

                  + policy {
                      + period_seconds = 5
                      + type           = "Percent"
                      + value          = 90
                    }
                }
            }

          + metric {
              + type = (known after apply)

              + external {
                  + metric {
                      + name = (known after apply)

                      + selector {
                          + match_labels = (known after apply)

                          + match_expressions {
                              + key      = (known after apply)
                              + operator = (known after apply)
                              + values   = (known after apply)
                            }
                        }
                    }

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }

              + object {
                  + described_object {
                      + api_version = (known after apply)
                      + kind        = (known after apply)
                      + name        = (known after apply)
                    }

                  + metric {
                      + name = (known after apply)

                      + selector {
                          + match_labels = (known after apply)

                          + match_expressions {
                              + key      = (known after apply)
                              + operator = (known after apply)
                              + values   = (known after apply)
                            }
                        }
                    }

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }

              + pods {
                  + metric {
                      + name = (known after apply)

                      + selector {
                          + match_labels = (known after apply)

                          + match_expressions {
                              + key      = (known after apply)
                              + operator = (known after apply)
                              + values   = (known after apply)
                            }
                        }
                    }

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }

              + resource {
                  + name = (known after apply)

                  + target {
                      + average_utilization = (known after apply)
                      + average_value       = (known after apply)
                      + type                = (known after apply)
                      + value               = (known after apply)
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "nodeapi"
            }
        }
    }

  # module.aks_namespace["app"].kubernetes_namespace.ns will be created
  + resource "kubernetes_namespace" "ns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.aks_role_binding["nodeapi"].kubernetes_role_binding.rb will be created
  + resource "kubernetes_role_binding" "rb" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "nodeapi"
            }
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "nodeapi"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "nodeapi"
          + namespace = "app"
        }
    }

  # module.aks_service["nodeapi"].kubernetes_service.svc will be created
  + resource "kubernetes_service" "svc" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "nodeapi"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 3000
              + protocol    = "TCP"
              + target_port = "3000"
            }
        }
    }

  # module.aks_service_account["nodeapi"].kubernetes_service_account.sa will be created
  + resource "kubernetes_service_account" "sa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "nodeapi"
            }
          + name             = "nodeapi"
          + namespace        = "app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @thcp, Action: `pull_request`*